; В этом файле определяются режимы игры.
; Режим игры по умолчанию можно изменить в config.ini (параметр DefaultGametype)
; Имена секций могут быть любыми.

[Gametype_0]
; Тип игры по умолчанию
; Имя типа игры
Name=Обычная игра
; Команда для смены режима на этот. Для смены режима администратор бота должен в игровом канале ввести "!игра ЭТОТ_ПАРАМЕТР". При этом не должна идти игра или набор игроков.
; Для этого примера команда получается такой: "!игра по умолчанию"
Command=по умолчанию
; Минимальное количество игроков, требуемое для старта игры (не менее 5)
MinPlayers=6
; Если параметр установлен в 1, игроки ночью могут комметировать свои действия.
ShowNightComments=0
; Если параметр установлен в 1, в начале игры будет показано, сколько игроков каждой роли в игре.
ShowRolesOnStart=0
; Если параметр установлен в 1, можно покупать вещи, иначе - магазин отключен
UseShop=1
; Если параметр установлен в 1, в игре будет якудза
UseYakuza=0
; Если параметр установлен в 1, в игре будет один нейтральный персонаж
UseNeutral=1
; Количество игроков, необходимое для того, чтобы в игре был нейтральный персонаж
PlayersForNeutral=8
; Если параметр установлен в 1, при ситуации, когда в игре останется одна команда и нейтральный персонаж, игра будет продолжаться,
; иначе - победа засчитывается оставшейся в живых команде.
NeutralCanWin=0
; Количество мафов (и якудз) определяется по значению следующего параметра: КОЛИЧЕСТВО_МАФОВ=Целая часть(КОЛИЧЕСТВО_ИГРОКОВ/ЗНАЧЕНИЕ ПАРАМЕТРА)
; Для игры с одной мафиозной группировкой значение должно быть не менее 2,5 (рекомендуется 3), при двух группировках (мафы и якудзы) - не менее 4 (рекомендуется 5).
MafCount=3
; Если параметр установлен в 1, в игре будет особый маф (Киллер, Адвокат или подрывник). Игнорируется при игре с якудзой.
UseSpecialMaf=1
; Количество игроков, необходимое для того, чтобы в игре был особый маф (не менее КОЛИЧЕСТВО_МАФОВ*3)
PlayersForSpecialMaf=12
; Тип комиссара
;   0 - Стреляющий комиссар (при проверке убивает мафа). Тип по умолчанию.
;   1 - Проверяющий комиссар (как в классической мафии).
;   2 - Детектив. Действия: проверить (как проверяющий комиссар) и подстрелить (как шериф).
ComType=0
; Если параметр установлен в 1, то стреляющий комиссар убьет маньяка при проверке
ComKillManiac=1
; Если параметр установлен в 1, то маньяк может использовать проклятие
ManiacCanUseCurse=1
; Вероятность заражения путаной (в %)
InfectionChance=50
; Если параметр установлен в 1, то результаты проверки комиссар, бомж, адвокат получают сразу.
; Кроме того, в случае наличия блокирующих персонажей длина ночи удвоится.
; Блокирующие персонажи не смогут ходить во 2 половину ночи, а проверяющие - в первую. Все остальные роли могут ходить в течение всей ночи.
InstantCheck=0
; Количество случайных помощников комиссара
ComHelpers=2

; Для каждой из специальных ролей (роли 3-255, кроме 101,151) (см. Readme.txt) можно настроить параметры появления этой роли в игре.
; Используются следующие параметры:
; UseRole_НОМЕРРОЛИ=ЗНАЧЕНИЕ
;   ЗНАЧЕНИЕ может быть:
;     0 - эта роль не будет использоваться в игре
;     1 - эта роль будет использоваться в игре как одна из случайных (по умолчанию). Для ролей от 102 - эквивалентно значению 2.
;     2 - эта роль всегда будет использоваться в игре (если достаточно игроков)
;
; Для каждой из специальных МИРНЫХ ролей от 3 до 99 включительно можно настроить дополнительно следующие параметры:
; RoleMinPlayers_НОМЕРРОЛИ=КОЛИЧЕСТВОИГРОКОВ
;   Определяет минимальное количество игроков, которое необходимо для появление роли НОМЕРРОЛИ при значении предыдущего параметра "2".
; RoleKnowCom_НОМЕРРОЛИ=ЗНАЧЕНИЕ
;   Если ЗНАЧЕНИЕ=1, то комиссар и игрок с этой ролью знают друг друга. По умолчанию - 0.

; Путана
UseRole_3=1
; Судья
UseRole_4=1
; Доктор
UseRole_5=1
; Старейшина
UseRole_6=1
; Горец
UseRole_7=1
; Шериф
UseRole_8=1
; Бомж
UseRole_9=1
; Сержант
UseRole_51=2
RoleMinPlayers_51=13
; Киллер
UseRole_102=2
; Адвокат
UseRole_103=2
; Подрывник
UseRole_104=2
; Маньяк
UseRole_201=2
; Робин Гуд
UseRole_202=2
; Грабитель
UseRole_203=2

; Для каждого режима игры можно отключить определенные предметы в магазине (по умолчанию все включены).
; Параметр выглядит следующим образом:
; ShopItemAllowed_НОМЕР=ЗНАЧЕНИЕ
;   НОМЕР: номер предмета (1 - маска, 2 - рация)
;   ЗНАЧЕНИЕ: 0 - предмет отключен, 1 - предмет включен
ShopItemAllowed_1=1
ShopItemAllowed_2=1

[Gametype_Yakuza]
; Обычная игра с 3мя мафиозными группировками
Name=Игра с якудзой
; Для этого примера команда получается такой: "!игра с японцами"
Command=с японцами
MinPlayers=6
ShowNightComments=0
ShowRolesOnStart=0
UseShop=1
UseYakuza=1
UseNeutral=1
NeutralCanWin=0
PlayersForNeutral=8
MafCount=5
UseSpecialMaf=0
PlayersForSpecialMaf=12
ComType=0
ComKillManiac=1
InstantCheck=0
ComHelpers=2
UseRole_3=1
UseRole_4=1
UseRole_5=1
UseRole_6=1
UseRole_7=1
UseRole_8=1
UseRole_9=1
UseRole_51=2
RoleMinPlayers_51=13
UseRole_102=2
UseRole_103=2
UseRole_104=2
UseRole_201=2
UseRole_202=2
UseRole_203=2

[Detective]
; Тип игры с парой "детектив + бомж" (http://commfort.com/ru/forum/viewtopic.php?p=42979#p42979)
Name=Игра с детективом
; Для этого примера команда получается такой: "!игра детектив"
Command=детектив
MinPlayers=6
ShowNightComments=1
ShowRolesOnStart=1
UseShop=0
UseYakuza=0
UseNeutral=0
NeutralCanWin=1
MafCount=3
UseSpecialMaf=1
PlayersForSpecialMaf=12
ComType=1
ComKillManiac=0
InstantCheck=1
ComHelpers=2

UseRole_3=1
UseRole_4=1
UseRole_5=1
UseRole_6=1
UseRole_7=1
; Шериф появляется при (15+) игроках
UseRole_8=2
RoleMinPlayers_8=15
; и он знает комиссара
RoleKnowCom_8=1
; Бомж появляется при (10+) игроках
UseRole_9=2
RoleMinPlayers_9=10
; и он знает комиссара
RoleKnowCom_9=1

UseRole_51=2
RoleMinPlayers_51=13
PlayersForNeutral=8
UseRole_102=2
UseRole_103=2
UseRole_104=2
UseRole_201=2
UseRole_202=2
UseRole_203=2

[Classic]
; Классическая игра
Name=Классическая игра
; Для этого примера команда получается такой: "!игра классическая"
Command=классическая
MinPlayers=6
ShowNightComments=0
ShowRolesOnStart=1
UseShop=0
UseYakuza=0
UseNeutral=0
MafCount=3
UseSpecialMaf=0
ComType=1
InstantCheck=0
ComHelpers=0

UseRole_3=0
UseRole_4=0
UseRole_5=0
UseRole_6=0
UseRole_7=0
UseRole_8=0
UseRole_9=0
UseRole_51=0
UseRole_102=0
UseRole_103=0
UseRole_104=0
UseRole_201=0
UseRole_202=0
UseRole_203=0

[NexxGen]
; Тип игры, аналогичный боту NexxGen'a
Name=Игра с путаной и доктором
; Для этого примера команда получается такой: "!игра путанадок"
Command=путанадок
MinPlayers=6
ShowNightComments=0
ShowRolesOnStart=1
UseShop=1
UseYakuza=0
UseNeutral=1
PlayersForNeutral=8
NeutralCanWin=0
MafCount=3
UseSpecialMaf=1
PlayersForSpecialMaf=12
ComType=0
ComKillManiac=1
ManiacCanUseCurse=0
InstantCheck=0
ComHelpers=0

UseRole_3=2
RoleMinPlayers_3=0
UseRole_4=0
UseRole_5=2
RoleMinPlayers_5=0
UseRole_6=0
UseRole_7=0
UseRole_8=0
UseRole_9=0
UseRole_51=0
UseRole_102=0
UseRole_103=0
UseRole_104=2
UseRole_201=2
UseRole_202=0
UseRole_203=0